    /*banner動畫*/
    var index_anim1
    var index_anim2
    /*首頁動畫 01換頁*/
    $(function () {
      index_anim1 = lottie.loadAnimation({
        animationData : JSON.parse('{"v":"5.5.10","fr":30,"ip":0,"op":295,"w":800,"h":500,"nm":"index_1-1phone","ddd":0,"assets":[{"id":"image_0","w":268,"h":444,"u":"images/","p":"01_index_1-1phone.png","e":0},{"id":"image_1","w":244,"h":434,"u":"images/","p":"04_index_1-1phone.png","e":0},{"id":"image_2","w":241,"h":428,"u":"images/","p":"03_index_1-1phone.png","e":0},{"id":"image_3","w":240,"h":426,"u":"images/","p":"02_index_1-1phone.png","e":0},{"id":"image_4","w":275,"h":449,"u":"images/","p":"bg_index_1-1phone.png","e":0}],"layers":[{"ddd":0,"ind":1,"ty":2,"nm":"05","refId":"image_0","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":263,"s":[0]},{"t":268,"s":[100]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":1,"k":[{"i":{"x":0.833,"y":0.833},"o":{"x":0.167,"y":0.167},"t":263,"s":[773,263,0],"to":[-65.167,0,0],"ti":[65.167,0,0]},{"t":268,"s":[382,263,0]}],"ix":2},"a":{"a":0,"k":[124,214,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"ip":263,"op":864,"st":263,"bm":0},{"ddd":0,"ind":2,"ty":2,"nm":"04","refId":"image_1","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":183,"s":[0]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":188,"s":[100]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":263,"s":[100]},{"t":268,"s":[0]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":1,"k":[{"i":{"x":0.833,"y":0.833},"o":{"x":0.167,"y":0.167},"t":183,"s":[936,262,0],"to":[-93.333,0,0],"ti":[92.333,-0.167,0]},{"t":188,"s":[376,262,0],"h":1},{"t":263,"s":[382,263,0],"h":1},{"t":268,"s":[-7,263,0],"h":1}],"ix":2},"a":{"a":0,"k":[122,217,0],"ix":1},"s":{"a":0,"k":[97,97,100],"ix":6}},"ao":0,"ip":183,"op":784,"st":183,"bm":0},{"ddd":0,"ind":3,"ty":2,"nm":"03","refId":"image_2","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":123,"s":[0]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":128,"s":[100]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":183,"s":[100]},{"t":188,"s":[0]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":1,"k":[{"i":{"x":0.833,"y":0.833},"o":{"x":0.167,"y":0.167},"t":123,"s":[936,262,0],"to":[-93.333,0,0],"ti":[92.333,-0.167,0]},{"t":128,"s":[376,262,0],"h":1},{"t":183,"s":[382,263,0],"h":1},{"t":188,"s":[-7,263,0],"h":1}],"ix":2},"a":{"a":0,"k":[120.5,214,0],"ix":1},"s":{"a":0,"k":[97,97,100],"ix":6}},"ao":0,"ip":123,"op":724,"st":123,"bm":0},{"ddd":0,"ind":4,"ty":2,"nm":"02","refId":"image_3","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":63,"s":[0]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":68,"s":[100]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":123,"s":[100]},{"t":128,"s":[0]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":1,"k":[{"i":{"x":0.833,"y":0.833},"o":{"x":0.167,"y":0.167},"t":63,"s":[936,262,0],"to":[-93.333,0,0],"ti":[92.333,-0.167,0]},{"t":68,"s":[376,262,0],"h":1},{"t":123,"s":[382,263,0],"h":1},{"t":128,"s":[-7,263,0],"h":1}],"ix":2},"a":{"a":0,"k":[120,213,0],"ix":1},"s":{"a":0,"k":[98,98,100],"ix":6}},"ao":0,"ip":63,"op":664,"st":36,"bm":0},{"ddd":0,"ind":5,"ty":2,"nm":"01","refId":"image_0","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":63,"s":[100]},{"t":68,"s":[0]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":1,"k":[{"i":{"x":0.833,"y":0.833},"o":{"x":0.167,"y":0.167},"t":63,"s":[382,263,0],"to":[-64.833,0,0],"ti":[64.833,0,0]},{"t":68,"s":[-7,263,0]}],"ix":2},"a":{"a":0,"k":[124,214,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"ip":0,"op":601,"st":0,"bm":0},{"ddd":0,"ind":6,"ty":2,"nm":"bg","refId":"image_4","sr":1,"ks":{"o":{"a":0,"k":100,"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[414.5,240.5,0],"ix":2},"a":{"a":0,"k":[137.5,224.5,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"ip":0,"op":601,"st":0,"bm":0}],"markers":[{"tm":90,"cm":"1","dr":0},{"tm":180,"cm":"2","dr":0},{"tm":270,"cm":"3","dr":0}]}'),

            loop: true,
            autoplay: false,
            renderer: 'svg',  //渲染方式，有"html"、"canvas"和"svg"三种
            container: document.getElementById('index1_1'),
            rendererSettings: {
            preserveAspectRatio: 'xMinYMin slice', // Supports the same options as the svg element's preserveAspectRatio property
          }
        });

          /*首頁動畫 02三個裝置輪替*/
          index_anim2 = lottie.loadAnimation({
          animationData : JSON.parse('{"v":"5.5.10","fr":30,"ip":0,"op":160,"w":500,"h":400,"nm":"index_1-4_all","ddd":0,"assets":[{"id":"image_0","w":368,"h":216,"u":"images/","p":"img_0.png","e":0},{"id":"image_1","w":99,"h":170,"u":"images/","p":"img_1.png","e":0},{"id":"image_2","w":99,"h":170,"u":"images/","p":"img_2.png","e":0},{"id":"image_3","w":156,"h":232,"u":"images/","p":"img_3.png","e":0},{"id":"image_4","w":150,"h":222,"u":"images/","p":"img_4.png","e":0},{"id":"image_5","w":370,"h":218,"u":"images/","p":"img_5.png","e":0}],"layers":[{"ddd":0,"ind":1,"ty":2,"nm":"mac 2","refId":"image_0","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":117,"s":[0]},{"t":127,"s":[100]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[287,191,0],"ix":2},"a":{"a":0,"k":[184,108,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"ip":0,"op":601,"st":0,"bm":0},{"ddd":0,"ind":2,"ty":2,"nm":"phone_black","refId":"image_1","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":105,"s":[0]},{"t":127,"s":[0]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[266.5,292,0],"ix":2},"a":{"a":0,"k":[49.5,85,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"ip":70,"op":671,"st":70,"bm":0},{"ddd":0,"ind":3,"ty":2,"nm":"phone","refId":"image_2","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":70,"s":[0]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":76,"s":[100]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":105,"s":[100]},{"t":127,"s":[0]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[266.5,292,0],"ix":2},"a":{"a":0,"k":[49.5,85,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"ip":70,"op":157,"st":70,"bm":0},{"ddd":0,"ind":4,"ty":2,"nm":"ipad_black","refId":"image_3","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":70,"s":[7]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":76,"s":[100]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":105,"s":[100]},{"t":127,"s":[0]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[137,261,0],"ix":2},"a":{"a":0,"k":[78,116,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"ip":27,"op":628,"st":27,"bm":0},{"ddd":0,"ind":5,"ty":2,"nm":"ipad","refId":"image_4","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":27,"s":[0]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":33,"s":[100]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":105,"s":[100]},{"t":127,"s":[0]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[137,261,0],"ix":2},"a":{"a":0,"k":[75,111,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"ip":27,"op":628,"st":27,"bm":0},{"ddd":0,"ind":6,"ty":2,"nm":"mac_black","refId":"image_5","sr":1,"ks":{"o":{"a":1,"k":[{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":27,"s":[0]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":33,"s":[100]},{"i":{"x":[0.833],"y":[0.833]},"o":{"x":[0.167],"y":[0.167]},"t":105,"s":[100]},{"t":127,"s":[0]}],"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[287,191,0],"ix":2},"a":{"a":0,"k":[185,109,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"ip":0,"op":601,"st":0,"bm":0},{"ddd":0,"ind":7,"ty":2,"nm":"mac","refId":"image_0","sr":1,"ks":{"o":{"a":0,"k":100,"ix":11},"r":{"a":0,"k":0,"ix":10},"p":{"a":0,"k":[287,191,0],"ix":2},"a":{"a":0,"k":[184,108,0],"ix":1},"s":{"a":0,"k":[100,100,100],"ix":6}},"ao":0,"ip":0,"op":601,"st":0,"bm":0}],"markers":[]}'),
              loop: true,
              autoplay: false,
              renderer: 'svg',  //渲染方式，有"html"、"canvas"和"svg"三种
              container: document.getElementById('index1_4'),
              rendererSettings: {
              preserveAspectRatio: 'xMinYMin slice', // Supports the same options as the svg element's preserveAspectRatio property
            }
            });
      $(".textbx h2").animate(
        {
          top: "0",
          opacity: "1",
        },
        800
      );
      $(".textbx h3").animate(
        {
          top: "0",
          opacity: "1",
        },
      800
      );
       $(".textbx h2").animate(
        {
          top: "0",
          opacity: "1",
        },
        800
      );

    });

    ///////////////////*視窗小於767時執行*///////////////////////////////////////////////
    if ($(window).width() < 767) {
      $(window).scroll(function () {
        var top = $(document).scrollTop();
      if (top > 2600) {
          $(".footerino h4").animate(
            {
              top: "0",
              opacity: "1",
            },
            600
          );
          $(".footerino p").animate(
            {
              top: "0",
              opacity: "1",
            },
            600
      );
        $(".footerino li .imgbx").addClass("animate__flipInY");
      }

      else if (top > 2500) {
        $(".indexcon .fm04 .imgbx").addClass("imgbxanmi");
          index_anim2.play();
      }

      else if (top > 2200) {
        $(".fm04 .txtbx").addClass("txtbxanmi");
      }

      else if (top > 1800) {

        $(".indexcon .fm03 .imgbx").addClass("imgbxanmi")
          index_anim1.play();   
      }

      else if (top > 1500) {
          $(".fm03 .Rbx").animate(
            {
              top: "0",
              opacity: "1",
            },
            600
          );
      }

      else if (top > 1000){
          $(".fm02 .Rbx .Rrpic").addClass("Rranmi")
          $(".fm02 .Rbx .Rlpic  ").addClass("Rlanmi") 
      } 

      else if (top > 600) {
          $(".fm02 .Lbx").animate(
            {
              top: "0",
              opacity: "1",
            },
            600
          );
      }

      else if (top > 400) {
        $(".indexcon .fm01 .imgbx").addClass("imgbxanmi")
          $(".fm01 .fmsby").addClass("vedio");
      } 

      else if (top > 100) {
          $(".fm01 .Rbx").animate(
            {
              top: "0",
              opacity: "1",
            },
            600
          );
      } 
      });
      
     ///////////////////*視窗大於767時執行* web///////////////////////////////////////////////
    } else {
      $(window).scroll(function () {
        var top = $(document).scrollTop();
        if (top > 2600) {
          $(".footerino h4").animate(
            {
              top: "0",
              opacity: "1",
            },
            600
          );
          $(".footerino p").animate(
            {
              top: "0",
              opacity: "1",
            },
            600
          );
          $(".footerino li .imgbx").addClass("animate__flipInY");
        }

        else  if (top > 2000) {
          $(".indexcon .fm04 .imgbx").addClass("imgbxanmi");
          $(".fm04 .txtbx").addClass("txtbxanmi");
          index_anim2.play();
        }

        else if (top > 1500) {
          $(".fm03 .Rbx").animate(
            {
              top: "0",
              opacity: "1",
            },
            600
          );
          $(".indexcon .fm03 .imgbx").addClass("imgbxanmi")
          index_anim1.play();               
        }

        else if (top > 800) {
          
          $(".fm02 .Rbx .Rrpic").addClass("Rranmi")
          $(".fm02 .Rbx .Rlpic  ").addClass("Rlanmi")
          $(".fm02 .Lbx").animate(
            {
              top: "0",
              opacity: "1",
            },
            600
          );
        }

        else if (top > 200) {
          $(".fm01 .Rbx").animate(
            {
              top: "0",
              opacity: "1",
            },
            600
          );
          $(".indexcon .fm01 .imgbx").addClass("imgbxanmi")
          $(".fm01 .fmsby").addClass("vedio");
          
        }
      });
    }